app/controllers/genres_controller.rb

  def index
    @genres = Genre.all
---
SELECT `genres`.* FROM `genres`