app/controllers/locals_controller.rb

SELECT  `federations`.* FROM `federations`  WHERE `federations`.`name` = 'NINES' LIMIT 1
---
	def index
		federation = Federation.find_by({ name: params[:federation] })